/// 1 创建型设计模式
/// 2 结构型设计模式
/// 3 行为型设计模式
/// 
/// 设计模式六大原则：单一职责 里氏替换 依赖倒置 最小接口 迪米特 开闭
///                   这些只能叫原则,叫建议,没有实际的招数
/// 面向对象23种设计模式：面向对象语言开发过程中，遇到的种种场景和问题，提出了解决方案和思路，
///                       沉淀下来就变成了设计模式
///                       解决具体问题的具体招数---套路---站在前辈的肩膀上
///                       
/// 创建型设计模式：关注对象的创建
/// 结构型设计模式：关注类与类之间的关系
/// 行为型设计模式：关注对象和行为的分离
/// 
/// 就是学习核心套路
/// 
/// 创建型设计模式：关注对象的创建，
/// 对象的创建不就是new()一下？其实有很多套路
/// 单例模式：就是限制了对象的创建，重用了对象
/// 原型模式：换个方式创建对象，不走构造函数，而是内存拷贝
/// 简单工厂：不直接new，把对象创建转移到工厂类
/// (简单工厂不属于23种设计模式)
/// 工厂方法：屏蔽对象的创建；留下了扩展空间；
/// 抽象工厂：屏蔽对象的创建；约束强制保障产品簇；
/// 建造者模式：复杂的工厂方法
Console.WriteLine("Hello, World!");
